In [11]:
import pandas as pd
import numpy as np

In [18]:
#Q1

d1=[4,8,15,16,23,32]
d1=np.array(d1)
pd.Series(d1)
d1

array([ 4,  8, 15, 16, 23, 32])

In [23]:
#Q2

d2=[1, 1, 1, 3, "red", 7, 9, 2, 3, 5]
d2=np.array(d2)
pd.Series(d2)

0      1
1      1
2      1
3      3
4    red
5      7
6      9
7      2
8      3
9      5
dtype: object

In [39]:
# Q3

d3={
    'Name':['Alice','Bob','Claire'],
    'Age':[25,30,27],
    'Gender':['Female','Male','Female']
}
df=pd.DataFrame(d3)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
# SERIES 1D
# DATAFRAME multi dim

In [ ]:
# all pandas data structures are VALUE MUTABLE

In [49]:
# DataFrame using multiple series

a=[1,2,3]
b=['one','two','three']

s1=pd.Series(a)
s2=pd.Series(b)

frame={
    'col1':s1,'col2':s2
}
pd.DataFrame(frame)

   col1   col2
0     1    one
1     2    two
2     3  three